Revit 2027 API
Rebar.SetHookTypeId Method
 Set the id of the RebarHookType to be applied to the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHookTypeId(
	int end,
	ElementId hookTypeId
)
Public Sub SetHookTypeId (
	end As Integer,
	hookTypeId As ElementId
)
public:
void SetHookTypeId(
	int end,
	ElementId^ hookTypeId
)
member SetHookTypeId :
        end : int *
        hookTypeId : ElementId -> unit
Parameters
end Int32
 0 for the start hook, 1 for the end hook.
hookTypeId ElementId
 The id of a RebarHookType element, or invalidElementId if the rebar should have no hook at the specified end.
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookTypeId is not valid
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace